results-n1-standard-8-60-second-tests/0200-development-summary.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: har-test-script.js

    duration: -, iterations: -
         vus: 1, max: 200

    init [----------------------------------------------------------] starting
    █ page_1 - https://test.devopsdirective.com/posts/2020/03/always-on-minikube/

      ✓ http2 is used
      ✓ status is 200
      ✓ content is present

    check_failure_rate.........: 0.00%   ✓ 0     ✗ 6029 
    checks.....................: 100.00% ✓ 18087 ✗ 0    
    data_received..............: 2.9 GB  48 MB/s
    data_sent..................: 12 MB   191 kB/s
    group_duration.............: avg=884.39ms min=233.23ms med=440.34ms max=10.64s   p(90)=1.85s    p(95)=4.28s  
    http_req_blocked...........: avg=132.57µs min=154ns    med=361ns    max=111.24ms p(90)=879ns    p(95)=1.08µs 
    http_req_connecting........: avg=61.49µs  min=0s       med=0s       max=23.55ms  p(90)=0s       p(95)=0s     
    http_req_duration..........: avg=291.37ms min=23.03ms  med=122.52ms max=10.54s   p(90)=651.4ms  p(95)=1.18s  
    http_req_receiving.........: avg=10.51ms  min=40.22µs  med=391.57µs max=7.52s    p(90)=5.14ms   p(95)=22.46ms
    http_req_sending...........: avg=30.43µs  min=10.79µs  med=29.02µs  max=3.17ms   p(90)=44.32µs  p(95)=51.91µs
    http_req_tls_handshaking...: avg=68.39µs  min=0s       med=0s       max=87.02ms  p(90)=0s       p(95)=0s     
    http_req_waiting...........: avg=280.82ms min=22.89ms  med=119.62ms max=7.74s    p(90)=622.39ms p(95)=1.15s  
    http_reqs..................: 73590   1226.498153/s
    iteration_duration.........: avg=884.42ms min=233.26ms med=440.36ms max=10.64s   p(90)=1.85s    p(95)=4.28s  
    iterations.................: 6029    100.483182/s
    vus........................: 199     min=4   max=199
    vus_max....................: 200     min=200 max=200