results-n1-standard-8-60-second-tests/0400-cache-summary.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: har-test-script.js

    duration: -, iterations: -
         vus: 1, max: 400

    init [----------------------------------------------------------] starting
    █ page_1 - https://test.devopsdirective.com/posts/2020/03/always-on-minikube/

      ✓ http2 is used
      ✓ status is 200
      ✓ content is present

    check_failure_rate.........: 0.00%   ✓ 0      ✗ 44750
    checks.....................: 100.00% ✓ 134256 ✗ 0    
    data_received..............: 21 GB   357 MB/s
    data_sent..................: 61 MB   1.0 MB/s
    group_duration.............: avg=245.56ms min=177.29ms med=221.1ms  max=1.68s    p(90)=341.83ms p(95)=388.76ms
    http_req_blocked...........: avg=46.35µs  min=136ns    med=317ns    max=191.46ms p(90)=508ns    p(95)=578ns   
    http_req_connecting........: avg=24.65µs  min=0s       med=0s       max=132.05ms p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=53.32ms  min=23.05ms  med=41.04ms  max=1.53s    p(90)=93.76ms  p(95)=116.4ms 
    http_req_receiving.........: avg=6.71ms   min=37µs     med=1.77ms   max=327.21ms p(90)=18.67ms  p(95)=27.6ms  
    http_req_sending...........: avg=42.28µs  min=10.82µs  med=36.1µs   max=53.6ms   p(90)=54.18µs  p(95)=61.68µs 
    http_req_tls_handshaking...: avg=20.78µs  min=0s       med=0s       max=91.46ms  p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=46.56ms  min=10.38ms  med=36.73ms  max=1.53s    p(90)=77.53ms  p(95)=93.62ms 
    http_reqs..................: 537783  8962.956974/s
    iteration_duration.........: avg=245.67ms min=177.32ms med=221.18ms max=1.68s    p(90)=342.05ms p(95)=389.08ms
    iterations.................: 44568   742.792291/s
    vus........................: 399     min=7    max=399
    vus_max....................: 400     min=400  max=400