results-n1-standard-8-60-second-tests/0400-development-summary.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: har-test-script.js

    duration: -, iterations: -
         vus: 1, max: 400

    init [----------------------------------------------------------] starting
    █ page_1 - https://test.devopsdirective.com/posts/2020/03/always-on-minikube/

      ✓ http2 is used
      ✓ status is 200
      ✓ content is present

    check_failure_rate.........: 0.00%   ✓ 0     ✗ 5422 
    checks.....................: 100.00% ✓ 16266 ✗ 0    
    data_received..............: 2.6 GB  44 MB/s
    data_sent..................: 11 MB   188 kB/s
    group_duration.............: avg=1.7s     min=235.72ms med=739.38ms max=24.23s   p(90)=4.71s   p(95)=8.35s  
    http_req_blocked...........: avg=278.4µs  min=140ns    med=360ns    max=129.94ms p(90)=925ns   p(95)=1.16µs 
    http_req_connecting........: avg=127.81µs min=0s       med=0s       max=43.53ms  p(90)=0s      p(95)=0s     
    http_req_duration..........: avg=588.27ms min=23.07ms  med=210.08ms max=22.47s   p(90)=1.55s   p(95)=2.61s  
    http_req_receiving.........: avg=52.57ms  min=42µs     med=440.57µs max=16.49s   p(90)=24.06ms p(95)=65.12ms
    http_req_sending...........: avg=32.04µs  min=10.91µs  med=30.37µs  max=4.04ms   p(90)=47.36µs p(95)=55.41µs
    http_req_tls_handshaking...: avg=139.52µs min=0s       med=0s       max=86.89ms  p(90)=0s      p(95)=0s     
    http_req_waiting...........: avg=535.67ms min=22.94ms  med=201.82ms max=18.71s   p(90)=1.42s   p(95)=2.19s  
    http_reqs..................: 67542   1125.69819/s
    iteration_duration.........: avg=1.7s     min=235.75ms med=739.4ms  max=24.23s   p(90)=4.71s   p(95)=8.35s  
    iterations.................: 5422    90.366521/s
    vus........................: 399     min=7   max=399
    vus_max....................: 400     min=400 max=400